var express = require('express');
var router = express.Router();

var title = '广州油麦菜信息科技有限公司'

var handle = function (req,res,next) {
  res.render('cases',{
    title:title,
    page:{
      totalPage:6,
      currentPage:1
    },
    prevUrl:"/cases/p/",
    caseList:[
      {
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },
      {
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      },{
        imgsrc:"/images/cases/newsico_20170905170429868.jpg",
        proName:"CC女神",
        content:"论坛推广是网站外推广的不错的途径。因为一般论坛权重很高，"+
        "尤其对新网站是个不错的推广方式。网站外论坛推广注意事项你又知道多少呢?"+
        "因为论坛可以供网页讨论，盲目的摆广告很可能给"+
        "自身的网站带来不好的影响。深圳网站建设公司优联创就来分享一"+
        "下论坛推广注意事项。"
      }
    ]
  });
}


router.get('/',function(req,res,next){
  handle(req,res,next);
})

router.get(/p\/[\/1-9]?/,function(req,res,next){
  handle(req,res,next);
})

module.exports = router;
